src/logs/smct/test-withdraw-20250730-175507.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: src/tests/smct/test-withdraw.ts
        output: -

     scenarios: (100.00%) 1 scenario, 500 max VUs, 40s max duration (incl. graceful stop):
              * default: 500 looping VUs for 10s (gracefulStop: 30s)


running (00.3s), 500/500 VUs, 0 complete and 0 interrupted iterations
default   [   3% ] 500 VUs  00.3s/10s

running (01.3s), 500/500 VUs, 0 complete and 0 interrupted iterations
default   [  13% ] 500 VUs  01.3s/10s

running (02.3s), 500/500 VUs, 0 complete and 0 interrupted iterations
default   [  23% ] 500 VUs  02.3s/10s

running (03.3s), 500/500 VUs, 0 complete and 0 interrupted iterations
default   [  33% ] 500 VUs  03.3s/10s

running (04.3s), 500/500 VUs, 0 complete and 0 interrupted iterations
default   [  43% ] 500 VUs  04.3s/10s

running (05.3s), 500/500 VUs, 0 complete and 0 interrupted iterations
default   [  53% ] 500 VUs  05.3s/10s

running (06.3s), 500/500 VUs, 0 complete and 0 interrupted iterations
default   [  63% ] 500 VUs  06.3s/10s

running (07.3s), 500/500 VUs, 0 complete and 0 interrupted iterations
default   [  73% ] 500 VUs  07.3s/10s

running (08.3s), 500/500 VUs, 0 complete and 0 interrupted iterations
default   [  83% ] 500 VUs  08.3s/10s

running (09.3s), 500/500 VUs, 0 complete and 0 interrupted iterations
default   [  93% ] 500 VUs  09.3s/10s

running (10.3s), 500/500 VUs, 0 complete and 0 interrupted iterations
default ↓ [ 100% ] 500 VUs  10s

running (11.3s), 500/500 VUs, 0 complete and 0 interrupted iterations
default ↓ [ 100% ] 500 VUs  10s

running (12.3s), 500/500 VUs, 0 complete and 0 interrupted iterations
default ↓ [ 100% ] 500 VUs  10s

running (13.3s), 500/500 VUs, 0 complete and 0 interrupted iterations
default ↓ [ 100% ] 500 VUs  10s

running (14.3s), 500/500 VUs, 0 complete and 0 interrupted iterations
default ↓ [ 100% ] 500 VUs  10s

running (15.3s), 500/500 VUs, 0 complete and 0 interrupted iterations
default ↓ [ 100% ] 500 VUs  10s

running (16.3s), 500/500 VUs, 0 complete and 0 interrupted iterations
default ↓ [ 100% ] 500 VUs  10s

running (17.3s), 500/500 VUs, 0 complete and 0 interrupted iterations
default ↓ [ 100% ] 500 VUs  10s

running (18.3s), 500/500 VUs, 0 complete and 0 interrupted iterations
default ↓ [ 100% ] 500 VUs  10s

running (19.3s), 500/500 VUs, 0 complete and 0 interrupted iterations
default ↓ [ 100% ] 500 VUs  10s

running (20.3s), 500/500 VUs, 0 complete and 0 interrupted iterations
default ↓ [ 100% ] 500 VUs  10s

running (21.3s), 500/500 VUs, 0 complete and 0 interrupted iterations
default ↓ [ 100% ] 500 VUs  10s

running (22.3s), 500/500 VUs, 0 complete and 0 interrupted iterations
default ↓ [ 100% ] 500 VUs  10s

running (23.3s), 500/500 VUs, 0 complete and 0 interrupted iterations
default ↓ [ 100% ] 500 VUs  10s

running (24.3s), 498/500 VUs, 2 complete and 0 interrupted iterations
default ↓ [ 100% ] 500 VUs  10s

running (25.3s), 498/500 VUs, 2 complete and 0 interrupted iterations
default ↓ [ 100% ] 500 VUs  10s

running (26.3s), 498/500 VUs, 2 complete and 0 interrupted iterations
default ↓ [ 100% ] 500 VUs  10s

running (27.3s), 488/500 VUs, 12 complete and 0 interrupted iterations
default ↓ [ 100% ] 500 VUs  10s

running (28.3s), 488/500 VUs, 12 complete and 0 interrupted iterations
default ↓ [ 100% ] 500 VUs  10s

running (29.3s), 488/500 VUs, 12 complete and 0 interrupted iterations
default ↓ [ 100% ] 500 VUs  10s

running (30.3s), 488/500 VUs, 12 complete and 0 interrupted iterations
default ↓ [ 100% ] 500 VUs  10s

running (31.3s), 487/500 VUs, 13 complete and 0 interrupted iterations
default ↓ [ 100% ] 500 VUs  10s

running (32.3s), 477/500 VUs, 23 complete and 0 interrupted iterations
default ↓ [ 100% ] 500 VUs  10s

running (33.3s), 477/500 VUs, 23 complete and 0 interrupted iterations
default ↓ [ 100% ] 500 VUs  10s

running (34.3s), 477/500 VUs, 23 complete and 0 interrupted iterations
default ↓ [ 100% ] 500 VUs  10s

running (35.3s), 469/500 VUs, 31 complete and 0 interrupted iterations
default ↓ [ 100% ] 500 VUs  10s

running (36.3s), 467/500 VUs, 33 complete and 0 interrupted iterations
default ↓ [ 100% ] 500 VUs  10s

running (37.3s), 467/500 VUs, 33 complete and 0 interrupted iterations
default ↓ [ 100% ] 500 VUs  10s

running (38.3s), 467/500 VUs, 33 complete and 0 interrupted iterations
default ↓ [ 100% ] 500 VUs  10s

running (39.3s), 462/500 VUs, 38 complete and 0 interrupted iterations
default ↓ [ 100% ] 500 VUs  10s


  █ TOTAL RESULTS 

    checks_total.......................: 43     1.072226/s
    checks_succeeded...................: 48.83% 21 out of 43
    checks_failed......................: 51.16% 22 out of 43

    ✗ status is 201
      ↳  48% — ✓ 21 / ✗ 22

    HTTP
    http_req_duration.......................................................: avg=32.27s min=23.47s med=31.3s  max=39.35s p(90)=38.91s p(95)=39.17s
      { expected_response:true }............................................: avg=31.27s min=23.55s med=31.11s max=38.39s p(90)=38.15s p(95)=38.15s
    http_req_failed.........................................................: 51.16% 22 out of 43
    http_reqs...............................................................: 43     1.072226/s

    EXECUTION
    iteration_duration......................................................: avg=32.77s min=23.8s  med=31.79s max=39.93s p(90)=39.49s p(95)=39.72s
    iterations..............................................................: 43     1.072226/s
    vus.....................................................................: 462    min=462      max=500
    vus_max.................................................................: 500    min=500      max=500

    NETWORK
    data_received...........................................................: 1.6 MB 40 kB/s
    data_sent...............................................................: 454 kB 11 kB/s



running (40.1s), 000/500 VUs, 43 complete and 457 interrupted iterations
default ✓ [ 100% ] 500 VUs  10s